**EJERCICIOS** 

1️⃣ Usando el diccionacrio dado Cread un *dataframe*.

  ```python

    diccionario = {"Nombre": ["Alejandro", "Anne", "Ana"], 
              "Apellidos": ["Sanz", "Krus", "García" ], 
              "Edad": [29, 30, 33], 
              "Provincia": ["Valencia", "Madrid", "Madrid"], 
              "Estudios": ["Físico", "Ingeniera", "Biologa"]}
  ```
    
    
2️⃣ Cread un *array* de NumPy con numeros aleatorios del 1 al 100 de dos dimensiones de 3 filas y 5 columnas (necesitaremos recordad conceptos adquiridos en la lección de NumPy 1). Los nombres de las columnas deben ser los dias de la semana de Lunes a Viernes. 


3️⃣ Empecemos a trabajar con `loc`e `iloc`. Usando el primer dataframe: 

   - Extrae todos los nombres de nuestro dataframe. 
   
   
   - ¿Cuántos años tiene Alejandro?
   
   
   - Extrae toda la información de las dos primeras columnas
   
   
   - ¿Quién tiene más de 30 años? Devolved solo el nombre. 
   
   
   - ¿Quién es de Madrid y tienen 30 años?
   
   
   - ¿Quién es Ingeniera o tiene menos de 30 años?
   

4️⃣ Momento de crear nuevas columnas: 

   - Cread una nueva columna a la que le sumeis 4 a todas las edades
   
   - Imaginemos ahora que Alejandro tiene 2 hermanos, Anne 1 y Ana 3. Insertad una nueva columna en la última posición con el número de hermanos de cada uno. 

   - Insertar una nueva columna donde tengamos el nombre y apellidos juntos. 
   
       **NOTA** De la misma forma que sumamos columnas numéricas podemos sumar columnas con strings

In [2]:
import numpy as np
import pandas as pd

In [5]:
# crear dataframe a partir de array
a = np.random.randint(0,100, (2,5))
a

array([[ 2, 88, 67, 84, 42],
       [19,  7, 49, 87, 33]])

In [4]:
df_array = pd.DataFrame(a, columns = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes"])
df_array

   Lunes  Martes  Miercoles  Jueves  Viernes
0     67      61         27      92       60
1     20      51         17      64       43

In [6]:
# crear dataframe a partir de diccionario

diccionario = {"Nombre": ["Alejandro", "Anne", "Ana"], 
              "Apellidos": ["Sanz", "Krus", "García" ], 
              "Edad": [29, 30, 33], 
              "Provincia": ["Valencia", "Madrid", "Madrid"], 
              "Estudios": ["Físico", "Ingeniera", "Biologa"]}

df = pd.DataFrame(diccionario)
df.head()

      Nombre Apellidos  Edad Provincia   Estudios
0  Alejandro      Sanz    29  Valencia     Físico
1       Anne      Krus    30    Madrid  Ingeniera
2        Ana    García    33    Madrid    Biologa

In [16]:
# Extrae todos los nombres de nuestro dataframe.
df.loc[:,"Nombre"]

0    Alejandro
1         Anne
2          Ana
Name: Nombre, dtype: object

In [15]:
#¿Cuántos años tiene Alejandro?
df.loc[0, "Edad"]

29

In [14]:
#Extrae toda la información de las dos primeras columnas
df.iloc[:,:2]

      Nombre Apellidos
0  Alejandro      Sanz
1       Anne      Krus
2        Ana    García

In [10]:

#¿Quién tiene más de 30 años? Devolved solo el nombre.
df[df["Edad"] > 30]["Nombre"]

2    Ana
Name: Nombre, dtype: object

In [11]:
#¿Quién es de Madrid y tienen 30 años?
df[(df["Edad"] == 30) & (df["Provincia"] == "Madrid")]

  Nombre Apellidos  Edad Provincia   Estudios
1   Anne      Krus    30    Madrid  Ingeniera

In [13]:
#¿Quién es Ingeniera o tiene menos de 30 años?
df[(df["Edad"] == 30) & (df["Estudios"] == "Ingeniera")]

  Nombre Apellidos  Edad Provincia   Estudios
1   Anne      Krus    30    Madrid  Ingeniera

In [17]:
# sumar edades

df["edades2"] = df["Edad"] + 4
df

      Nombre Apellidos  Edad Provincia   Estudios  edades2
0  Alejandro      Sanz    29  Valencia     Físico       33
1       Anne      Krus    30    Madrid  Ingeniera       34
2        Ana    García    33    Madrid    Biologa       37

In [18]:
# hermanos

df.insert(6, "hermanos", [2,1,3])
df

      Nombre Apellidos  Edad Provincia   Estudios  edades2  hermanos
0  Alejandro      Sanz    29  Valencia     Físico       33         2
1       Anne      Krus    30    Madrid  Ingeniera       34         1
2        Ana    García    33    Madrid    Biologa       37         3

In [19]:
#columna nombre completa
df["nombre_completo"] = df["Nombre"] + " " +  df["Apellidos"]
df

,Nombre,Apellidos,Edad,Provincia,Estudios,edades2,hermanos,nombre_completo
0,Alejandro,Sanz,29,Valencia,Físico,33,2,Alejandro Sanz
1,Anne,Krus,30,Madrid,Ingeniera,34,1,Anne Krus
2,Ana,García,33,Madrid,Biologa,37,3,Ana García